In [37]:
#import ing the required modules
import os
import pandas as pd
import numpy as np

In [16]:
#nested list for creating dataframe (matrix)
samples=[[1,2,3],[4,5,6],[7,8,9]]

In [17]:
samples

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [18]:
#syntax for creating dataframe with pandas
matrix=pd.DataFrame(samples)

In [19]:
matrix

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [22]:
#name the header aka the column names
matrix.columns=['first','second','third']

In [23]:
matrix

   first  second  third
0      1       2      3
1      4       5      6
2      7       8      9

In [24]:
#indexing the matrix aka give names to the rows
matrix.index=['a','b','c']

In [25]:
matrix

   first  second  third
a      1       2      3
b      4       5      6
c      7       8      9

In [27]:
#each selected columns (rows also) acts like pandas series (vectors)...
type(matrix['first'])

pandas.core.series.Series

In [30]:
#...so all the vector based calculations can be executed on them
np.sum(matrix['first'])

12

In [31]:
matrix['first']+2

a    3
b    6
c    9
Name: first, dtype: int64

In [33]:
matrix

   first  second  third
a      1       2      3
b      4       5      6
c      7       8      9

In [32]:
#get one row of a dataframe
matrix.loc['a']

first     1
second    2
third     3
Name: a, dtype: int64

In [35]:
#select the row where condition meets
matrix.loc[matrix['second']==5]

   first  second  third
b      4       5      6

In [40]:
#writing matrix to csv file
matrix.to_csv('../results/proba.csv')

In [44]:
#reading csv file as a matrix, specifying the index column
callback=pd.read_csv('../results/proba.csv',index_col=0)

In [45]:
callback

   first  second  third
a      1       2      3
b      4       5      6
c      7       8      9

In [43]:
matrix

   first  second  third
a      1       2      3
b      4       5      6
c      7       8      9

In [46]:
callback==matrix

   first  second  third
a   True    True   True
b   True    True   True
c   True    True   True